# running in async_fifo/src/
read -formal async_fifo_formal.sv
read -formal async_fifo.sv
prep -top async_fifo_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
