# running in axi_crossbar/src/
read -formal axi_crossbar_formal.sv
read -formal axi_crossbar.sv
prep -top axi_crossbar_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
